In [1]:
import pandas as pd
import psycopg2

from sqlalchemy import create_engine, text

In [2]:
conn_string = "host='db' dbname='postgres' user='postgres'"

In [3]:
conn = psycopg2.connect(conn_string)

In [4]:
cursor = conn.cursor()

In [7]:
!pwd

/app/src/notebooks/Kurmangazy

In [9]:
df = pd.read_csv('/app/Data/Titanic/train.csv')

In [10]:
df_test = pd.read_csv('/app/Data/Titanic//test.csv')

In [40]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
engine = create_engine('postgresql://postgres@db:5432/postgres')

In [28]:
#загружаем данные в postgres
df.to_sql('titanic_train', con=engine)

891

In [12]:
df_test.to_sql('titanic_test', con=engine)

418

In [6]:
# читаем данные из postgres
with engine.begin() as conn:
    query = text("""
    SELECT * 
    FROM titanic_train
    """)
    df_pg = pd.read_sql_query(query, conn)

In [7]:
df_pg.head(5)

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,None,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,None,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,None,S

In [8]:
df_pg.shape

(891, 13)

In [9]:
13*891

11583

In [12]:
df_pg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   index        891 non-null    int64
 1   PassengerId  891 non-null    int64
 2   Survived     891 non-null    int64
 3   Pclass       891 non-null    int64
 4   Name         891 non-null    object
 5   Sex          891 non-null    object
 6   Age          714 non-null    float64
 7   SibSp        891 non-null    int64
 8   Parch        891 non-null    int64
 9   Ticket       891 non-null    object
 10  Fare         891 non-null    float64
 11  Cabin        204 non-null    object
 12  Embarked     889 non-null    object
dtypes: float64(2), int64(6), object(5)
memory usage: 90.6+ KB